Ran Plan for dir: `infrastructure/gcp/k8s-deployment/helm_externaldns` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.gcloud_dns_ols: Reading...
data.terraform_remote_state.gcloud_dns_ols: Read complete after 0s
data.google_project.current: Reading...
data.google_client_config.current: Reading...
data.google_client_config.current: Read complete after 0s [id=projects/"onlineshop-378118"/regions/"asia-southeast2"/zones/<null>]
data.google_project.current: Read complete after 2s [id=projects/onlineshop-378118]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.externaldns.google_project_iam_member.sa_iam[0] will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "onlineshop-378118"
      + role    = "roles/dns.admin"
    }

  # module.externaldns.google_service_account.gsa[0] will be created
+ resource "google_service_account" "gsa" {
      + account_id   = "ols-dev-helm-external-dns"
      + disabled     = false
      + display_name = "Service Account for helm ols-dev-helm-external-dns"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "onlineshop-378118"
      + unique_id    = (known after apply)
    }

  # module.externaldns.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ols-external-dns"
      + namespace                  = "ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "6.23.6"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "google.project"
          + value = "onlineshop-378118"
        }
      + set {
          + name  = "provider"
          + value = "google"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "ols-dev-helm-external-dns"
        }
      + set {
          + name  = "zoneVisibility"
          + value = "public"
        }
    }

  # module.externaldns.kubernetes_cluster_role.external_dns[0] will be created
+ resource "kubernetes_cluster_role" "external_dns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ols-dev-helm-external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "services",
              + "endpoints",
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.externaldns.kubernetes_cluster_role_binding.external_dns[0] will be created
+ resource "kubernetes_cluster_role_binding" "external_dns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ols-dev-helm-external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "ols-dev-helm-external-dns"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "ols-dev-helm-external-dns"
          + namespace = "ingress"
        }
    }

  # module.externaldns.kubernetes_namespace.namespace[0] will be created
+ resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.externaldns.kubernetes_service_account.ksa[0] will be created
+ resource "kubernetes_service_account" "ksa" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ols-dev-helm-external-dns"
          + namespace        = "ingress"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/k8s-deployment/helm_externaldns`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fk8s-deployment%252Fhelm_externaldns%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/k8s-deployment/helm_externaldns`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`